# Pandas

## 시리즈

In [315]:
import pandas as pd
prices = [1000, 1010, 1020]
seris1 = pd.Series(prices)
seris1

0    1000
1    1010
2    1020
dtype: int64

In [316]:
# 인덱스 부여
dates = pd.date_range('20230101', periods=3)
seris2 = pd.Series(prices, index=dates)
seris2

2023-01-01    1000
2023-01-02    1010
2023-01-03    1020
Freq: D, dtype: int64

### date_range 활용

In [317]:
pd.date_range('2022-01-01', '2023-01-01', freq='M')
pd.date_range('2022-01-01', '2023-01-01', freq='MS')
# freq='M' 
# # M 말일을 출력한다
# MS 초일을 출력한다

DatetimeIndex(['2022-01-01', '2022-02-01', '2022-03-01', '2022-04-01',
               '2022-05-01', '2022-06-01', '2022-07-01', '2022-08-01',
               '2022-09-01', '2022-10-01', '2022-11-01', '2022-12-01',
               '2023-01-01'],
              dtype='datetime64[ns]', freq='MS')

In [318]:
seris2[2] = 100
seris2

2023-01-01    1000
2023-01-02    1010
2023-01-03     100
Freq: D, dtype: int64

## 데이터프레임

In [319]:
prices = {
    'SK' : [44000, 44500, 45000],
    'Samsung' : [70100, 70200, 70300],
    'LG' : [85000, 85500, 86000]
}
df1 = pd.DataFrame(prices)
df1

      SK  Samsung     LG
0  44000    70100  85000
1  44500    70200  85500
2  45000    70300  86000

In [320]:
df2 = pd.DataFrame(prices, index=dates)
df2

               SK  Samsung     LG
2023-01-01  44000    70100  85000
2023-01-02  44500    70200  85500
2023-01-03  45000    70300  86000

## 데이터 선택
- loc : index, column 으로 데이터를 가져온다.
1. 데이터프레임의 행이나 컬럼에 label이나 boolean array로 접근.
2. location의 약어로, 인간이 읽을 수 있는 label 값으로 데이터에 접근하는 것이다. 

- iloc : 데이터 순서로 데이터를 가져온다.
1. 데이터프레임의 행이나 컬럼에 인덱스 값으로 접근.
2. integer location의 약어로, 컴퓨터가 읽을 수 있는 indexing 값으로 데이터에 접근하는 것이다.

In [321]:
df2.iloc[:,:] # df2.iloc[:] # 동일하게 전체 출력

               SK  Samsung     LG
2023-01-01  44000    70100  85000
2023-01-02  44500    70200  85500
2023-01-03  45000    70300  86000

In [322]:
df2.iloc[0] # 첫 행

SK         44000
Samsung    70100
LG         85000
Name: 2023-01-01 00:00:00, dtype: int64

In [323]:
df2.iloc[:,0] # 첫 행 전체 + 인덱스까지 출력
# 행 전체
# 열 0번째만

2023-01-01    44000
2023-01-02    44500
2023-01-03    45000
Freq: D, Name: SK, dtype: int64

In [324]:
df2.iloc[0,0]

44000

In [325]:
df2.loc['2023-01-02']

SK         44500
Samsung    70200
LG         85500
Name: 2023-01-02 00:00:00, dtype: int64

In [326]:
df2.loc[:,'SK']

2023-01-01    44000
2023-01-02    44500
2023-01-03    45000
Freq: D, Name: SK, dtype: int64

In [327]:
df2.SK # df2.column

2023-01-01    44000
2023-01-02    44500
2023-01-03    45000
Freq: D, Name: SK, dtype: int64

In [328]:
df2['POSCO'] = [450000,455000,460000]
df2

               SK  Samsung     LG   POSCO
2023-01-01  44000    70100  85000  450000
2023-01-02  44500    70200  85500  455000
2023-01-03  45000    70300  86000  460000

In [329]:
# 실습
# Q1. 2023년 1월 2일 ~ 2023 1월 3일 까지의 '삼성전자', 'LG전자' 데이터를 가져와주세요.
df2.iloc[1:3,[1,2]]

            Samsung     LG
2023-01-02    70200  85500
2023-01-03    70300  86000

In [330]:
df2.loc['2023-01-02':'2023-01-03','Samsung':'LG']

            Samsung     LG
2023-01-02    70200  85500
2023-01-03    70300  86000

In [331]:
# Q2. 데이터 70200원 가져오기 (iloc, loc 각각 활용)
df2.Samsung[1]

70200

In [332]:
df2.iloc[1,1]

70200

In [333]:
df2.loc['2023-01-02','Samsung']

70200

In [334]:
print(df2.head())

               SK  Samsung     LG   POSCO
2023-01-01  44000    70100  85000  450000
2023-01-02  44500    70200  85500  455000
2023-01-03  45000    70300  86000  460000

# 데이터프레임 확장
- concat : 그냥 가져다 붙이는 거
- merge : 공통고니 칼럼이나 인덱스가 있는가 있는 경우

In [335]:
s1 = pd.Series([500000, 500500, 501000], index=dates, name='LG화학')

In [336]:
concat_df2 = pd.concat([df2, s1], axis=1)
concat_df2.head()

               SK  Samsung     LG   POSCO    LG화학
2023-01-01  44000    70100  85000  450000  500000
2023-01-02  44500    70200  85500  455000  500500
2023-01-03  45000    70300  86000  460000  501000

In [337]:
s2 = pd.Series([600000, 600500, 601000], index=dates, name='이더리움')
concat_df2 = pd.concat([concat_df2, s2], axis=1)
concat_df2.head()

               SK  Samsung     LG   POSCO    LG화학    이더리움
2023-01-01  44000    70100  85000  450000  500000  600000
2023-01-02  44500    70200  85500  455000  500500  600500
2023-01-03  45000    70300  86000  460000  501000  601000

In [338]:
concat_df2.loc['2023-01-06',:] = [44000, 70100, 85000, 455000, 505000, 505500]
concat_df2.head()

                 SK  Samsung       LG     POSCO      LG화학      이더리움
2023-01-01  44000.0  70100.0  85000.0  450000.0  500000.0  600000.0
2023-01-02  44500.0  70200.0  85500.0  455000.0  500500.0  600500.0
2023-01-03  45000.0  70300.0  86000.0  460000.0  501000.0  601000.0
2023-01-06  44000.0  70100.0  85000.0  455000.0  505000.0  505500.0

In [339]:
concat_df2.loc['2023-01-05',:] = concat_df2.loc['2023-01-06',:] - 100
concat_df2.head()

                 SK  Samsung       LG     POSCO      LG화학      이더리움
2023-01-01  44000.0  70100.0  85000.0  450000.0  500000.0  600000.0
2023-01-02  44500.0  70200.0  85500.0  455000.0  500500.0  600500.0
2023-01-03  45000.0  70300.0  86000.0  460000.0  501000.0  601000.0
2023-01-06  44000.0  70100.0  85000.0  455000.0  505000.0  505500.0
2023-01-05  43900.0  70000.0  84900.0  454900.0  504900.0  505400.0

In [340]:
concat_df2.sort_index() # 인덱스 정렬 후 출력

                 SK  Samsung       LG     POSCO      LG화학      이더리움
2023-01-01  44000.0  70100.0  85000.0  450000.0  500000.0  600000.0
2023-01-02  44500.0  70200.0  85500.0  455000.0  500500.0  600500.0
2023-01-03  45000.0  70300.0  86000.0  460000.0  501000.0  601000.0
2023-01-05  43900.0  70000.0  84900.0  454900.0  504900.0  505400.0
2023-01-06  44000.0  70100.0  85000.0  455000.0  505000.0  505500.0

In [341]:
concat_df2.sort_values(by='Samsung') # 오름차순

                 SK  Samsung       LG     POSCO      LG화학      이더리움
2023-01-05  43900.0  70000.0  84900.0  454900.0  504900.0  505400.0
2023-01-01  44000.0  70100.0  85000.0  450000.0  500000.0  600000.0
2023-01-06  44000.0  70100.0  85000.0  455000.0  505000.0  505500.0
2023-01-02  44500.0  70200.0  85500.0  455000.0  500500.0  600500.0
2023-01-03  45000.0  70300.0  86000.0  460000.0  501000.0  601000.0

In [342]:
concat_df2.sort_values(by='Samsung', ascending=False) # 내림차순

                 SK  Samsung       LG     POSCO      LG화학      이더리움
2023-01-03  45000.0  70300.0  86000.0  460000.0  501000.0  601000.0
2023-01-02  44500.0  70200.0  85500.0  455000.0  500500.0  600500.0
2023-01-01  44000.0  70100.0  85000.0  450000.0  500000.0  600000.0
2023-01-06  44000.0  70100.0  85000.0  455000.0  505000.0  505500.0
2023-01-05  43900.0  70000.0  84900.0  454900.0  504900.0  505400.0

In [343]:
concat_df2.drop('2023-01-03') # 변수에 저장되지 않고 출력만 된다.

                 SK  Samsung       LG     POSCO      LG화학      이더리움
2023-01-01  44000.0  70100.0  85000.0  450000.0  500000.0  600000.0
2023-01-02  44500.0  70200.0  85500.0  455000.0  500500.0  600500.0
2023-01-06  44000.0  70100.0  85000.0  455000.0  505000.0  505500.0
2023-01-05  43900.0  70000.0  84900.0  454900.0  504900.0  505400.0

In [344]:
concat_df2.drop('2023-01-03',inplace=True) # inplace 옵션으로 저장된다.
concat_df2.head()

                 SK  Samsung       LG     POSCO      LG화학      이더리움
2023-01-01  44000.0  70100.0  85000.0  450000.0  500000.0  600000.0
2023-01-02  44500.0  70200.0  85500.0  455000.0  500500.0  600500.0
2023-01-06  44000.0  70100.0  85000.0  455000.0  505000.0  505500.0
2023-01-05  43900.0  70000.0  84900.0  454900.0  504900.0  505400.0

In [345]:
concat_df2.drop('이더리움', axis=1) # column drop 예시

                 SK  Samsung       LG     POSCO      LG화학
2023-01-01  44000.0  70100.0  85000.0  450000.0  500000.0
2023-01-02  44500.0  70200.0  85500.0  455000.0  500500.0
2023-01-06  44000.0  70100.0  85000.0  455000.0  505000.0
2023-01-05  43900.0  70000.0  84900.0  454900.0  504900.0

In [346]:
concat_df2.drop(['이더리움','SK'], axis=1) # column 을 리스트로 받아 drop

            Samsung       LG     POSCO      LG화학
2023-01-01  70100.0  85000.0  450000.0  500000.0
2023-01-02  70200.0  85500.0  455000.0  500500.0
2023-01-06  70100.0  85000.0  455000.0  505000.0
2023-01-05  70000.0  84900.0  454900.0  504900.0

In [347]:
concat_df2['sum'] = concat_df2.sum(axis=1) 
concat_df2

                 SK  Samsung       LG     POSCO      LG화학      이더리움        sum
2023-01-01  44000.0  70100.0  85000.0  450000.0  500000.0  600000.0  1749100.0
2023-01-02  44500.0  70200.0  85500.0  455000.0  500500.0  600500.0  1756200.0
2023-01-06  44000.0  70100.0  85000.0  455000.0  505000.0  505500.0  1664600.0
2023-01-05  43900.0  70000.0  84900.0  454900.0  504900.0  505400.0  1664000.0

In [348]:
concat_df2.min(axis=0) # print min

SK           43900.0
Samsung      70000.0
LG           84900.0
POSCO       450000.0
LG화학        500000.0
이더리움        505400.0
sum        1664000.0
dtype: float64

In [349]:
concat_df2.describe() # 문자 제외하고 컬럼별 정리

,SK,Samsung,LG,POSCO,LG화학,이더리움,sum
count,4.00000,4.000000,4.00000,4.00000,4.000000,4.00000,4.000000e+00
mean,44100.00000,70100.000000,85100.00000,453725.00000,502600.000000,552850.00000,1.708475e+06
std,270.80128,81.649658,270.80128,2483.78072,2721.519184,54733.20138,5.109177e+04
min,43900.00000,70000.000000,84900.00000,450000.00000,500000.000000,505400.00000,1.664000e+06
25%,43975.00000,70075.000000,84975.00000,453675.00000,500375.000000,505475.00000,1.664450e+06
50%,44000.00000,70100.000000,85000.00000,454950.00000,502700.000000,552750.00000,1.706850e+06
75%,44125.00000,70125.000000,85125.00000,455000.00000,504925.000000,600125.00000,1.750875e+06
max,44500.00000,70200.000000,85500.00000,455000.00000,505000.000000,600500.00000,1.756200e+06

# 결측치
- 제거 : dropna
- 대체 : fillna, interpolate

In [350]:
import pandas as pd

df = pd.DataFrame({
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
})

In [351]:
print(df.sum(axis=0)) # 열 합계

A     6
B    15
C    24
dtype: int64

In [352]:
# Q1. 2022-01-01 ~ 2022-12-01 월초 인덱스를 생성
dates3 = pd.date_range('2022-01-01', '2022-12-01', freq='MS')

In [353]:
# Q2. Q1에서 생성한 인덱스를 가지고 데이터프레임 생성(값은 자율, 이때 칼럼이름은 value)
import random
randomlist = [random.randint(0,100) for i in range(len(dates3))]

df = pd.DataFrame({
        'value' : randomlist}
        ,index=dates3)
df

            value
2022-01-01      9
2022-02-01     55
2022-03-01     49
2022-04-01     62
2022-05-01      7
2022-06-01     15
2022-07-01     64
2022-08-01     44
2022-09-01     14
2022-10-01     54
2022-11-01     46
2022-12-01    100

In [354]:
# Q3. value 칼럼에서 100을 더한 value_add_100 칼럼을 생성해주세요.
df.loc[:,'value_add_100'] = df.loc[:,'value'] + 100
df

            value  value_add_100
2022-01-01      9            109
2022-02-01     55            155
2022-03-01     49            149
2022-04-01     62            162
2022-05-01      7            107
2022-06-01     15            115
2022-07-01     64            164
2022-08-01     44            144
2022-09-01     14            114
2022-10-01     54            154
2022-11-01     46            146
2022-12-01    100            200

In [355]:
# Q4. value 칼럼과 value_add_100 칼럼을 평균한 mean 칼럼을 생성해주세요.
df.loc[:,'value_mean'] = df.mean(axis=1)
df

            value  value_add_100  value_mean
2022-01-01      9            109        59.0
2022-02-01     55            155       105.0
2022-03-01     49            149        99.0
2022-04-01     62            162       112.0
2022-05-01      7            107        57.0
2022-06-01     15            115        65.0
2022-07-01     64            164       114.0
2022-08-01     44            144        94.0
2022-09-01     14            114        64.0
2022-10-01     54            154       104.0
2022-11-01     46            146        96.0
2022-12-01    100            200       150.0

fillna, interpolate

In [356]:
# 임의로 중복 데이터 생성
concat_df3 = concat_df2.copy()
concat_df4 = pd.concat([concat_df2, concat_df3])
concat_df4

                 SK  Samsung       LG     POSCO      LG화학      이더리움        sum
2023-01-01  44000.0  70100.0  85000.0  450000.0  500000.0  600000.0  1749100.0
2023-01-02  44500.0  70200.0  85500.0  455000.0  500500.0  600500.0  1756200.0
2023-01-06  44000.0  70100.0  85000.0  455000.0  505000.0  505500.0  1664600.0
2023-01-05  43900.0  70000.0  84900.0  454900.0  504900.0  505400.0  1664000.0
2023-01-01  44000.0  70100.0  85000.0  450000.0  500000.0  600000.0  1749100.0
2023-01-02  44500.0  70200.0  85500.0  455000.0  500500.0  600500.0  1756200.0
2023-01-06  44000.0  70100.0  85000.0  455000.0  505000.0  505500.0  1664600.0
2023-01-05  43900.0  70000.0  84900.0  454900.0  504900.0  505400.0  1664000.0

In [357]:
concat_df4.drop_duplicates() # 중복 제거

                 SK  Samsung       LG     POSCO      LG화학      이더리움        sum
2023-01-01  44000.0  70100.0  85000.0  450000.0  500000.0  600000.0  1749100.0
2023-01-02  44500.0  70200.0  85500.0  455000.0  500500.0  600500.0  1756200.0
2023-01-06  44000.0  70100.0  85000.0  455000.0  505000.0  505500.0  1664600.0
2023-01-05  43900.0  70000.0  84900.0  454900.0  504900.0  505400.0  1664000.0

In [358]:
concat_df2.loc['2023-01-03',:] = concat_df2.loc['2023-01-06',:].copy()
concat_df2.sort_index(inplace = True)

In [359]:
# 삼성전자의 중복만 제거하여 데이터프레임 형태로 출력
idx = concat_df2['Samsung'].drop_duplicates().index
concat_df2.loc[idx,:] 
# 인덱스 기준으로 데이터를 가져오는 활용

                 SK  Samsung       LG     POSCO      LG화학      이더리움        sum
2023-01-01  44000.0  70100.0  85000.0  450000.0  500000.0  600000.0  1749100.0
2023-01-02  44500.0  70200.0  85500.0  455000.0  500500.0  600500.0  1756200.0
2023-01-05  43900.0  70000.0  84900.0  454900.0  504900.0  505400.0  1664000.0